# Найдите количество чисел являющихся палиндромами в диапазоне от a до b включительно
# Известно, что a и b целые положительные числа.

a = ...
b = ...
while a < b:
    if str(a) == str(a) [:: - 1]:
        print(a)
    a = a + 1
